# Loading and tidying "real" data

## Tidy data as a concept

<img src="files/tidy_rdatasci.png" width=800>

Import to note "tidy" data is not the only way to work

Pandas brief descriptor <https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf>

### Loading data

Loading data into python is actually pretty easy with pandas! First let's load the pandas module

In [1]:
import pandas as pd

Now - let's try to load some of the data we have in the `data` directory.  First - just take a look at the data (`tb_2014.csv`) by navigating to it in your file folder and opening it in jupyter like so (I have rainbow_CSV on leading to the colors):
<img src="files/tb_2014_rainbow.png">

You could also open this in excel if you prefer - by downloading the csv and opening it.

We can see that this data is a typical spreadsheet with columns and rows. CSV stands for **C**omma **S**eparated **V**ariables.

This data is information about tuberculosis prevalance from the UN WHO from 1980-2014.  There is a `country` column, then the `iso2` and `iso3` columns which appear to be appreviations (2 and 3 letter) of the country name.  A `year` column which is self explanatory.   
Then there are columns for data - where the column name means:
- The first three letters say if it's a "new" or "old" case of TB
- The next two letters tell us what type of TB
    - rel are relapsed cases
    - ep are extrapulmonary TB
    - sn are pulmonary TB with a negative pulmonary smear
    - sp are pulmonary TB with a positive pulmonary smear
- The next letter tells us the sex of TB patients give by males (m) or females (f)
- The remaining numbers tell us the age group
    - 014 is 0-14 years old
    - 1524 is 15-24 years old
    - 2534 is 25-34 years old
    - 3544 is 35-44 years old
    - 4554 is 45-54 years old
    - 5564 is 55-64 years old
    - 65 is 65 or older

Now let's load it in to python! Pandas has a bunch of different reading and writing functions: <https://pandas.pydata.org/pandas-docs/stable/reference/io.html>  I'm going to use `read_csv` here.  I type tb_raw again afterwards so that we can see the output - this is not necessary in your own code (unless you want to).

In [2]:
tb_raw=pd.read_csv('../data/tb_2014.csv')
tb_raw

,country,iso2,iso3,year,new_sp_m014,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,new_sp_m5564,...,newrel_m4554,newrel_m5564,newrel_m65,newrel_f014,newrel_f1524,newrel_f2534,newrel_f3544,newrel_f4554,newrel_f5564,newrel_f65
0,Afghanistan,AF,AFG,1980,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,AF,AFG,1981,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,AF,AFG,1982,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Afghanistan,AF,AFG,1983,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Afghanistan,AF,AFG,1984,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7235,Zimbabwe,ZW,ZWE,2009,125.0,578.0,NaN,3471.0,681.0,293.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7236,Zimbabwe,ZW,ZWE,2010,150.0,710.0,2208.0,1682.0,761.0,350.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7237,Zimbabwe,ZW,ZWE,2011,152.0,784.0,2467.0,2071.0,780.0,377.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7238,Zimbabwe,ZW,ZWE,2012,120.0,783.0,2421.0,2086.0,796.0,360.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7239,Zimbabwe,ZW,ZWE,2013,NaN,NaN,NaN,NaN,NaN,NaN,...,2349.0,1206.0,1208.0,1252.0,2069.0,4649.0,3526.0,1453.0,811.0,725.0

So - we now have loaded the file into a pandas "dataframe" called tb_raw.  This is the variable name that lets us organize and access the data.   
This is certainly a useful way to look at the data, but it's in "wide" form instead of "long" or tidy from.
Each row corresponds to a country year, but the categorical observations of new/old, type of TB, sex and age in one column, and all for the same country/year in the same row.

Let's manipulate this data to "tidy" it.   
I don't think we need the extra `iso2` and `iso3` columns, so let's get rid of them, using the pandas `drop` function <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html>

In [3]:
tb=tb_raw.drop(columns=['iso2', 'iso3'])
tb

,country,year,new_sp_m014,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,new_sp_m5564,new_sp_m65,new_sp_f014,...,newrel_m4554,newrel_m5564,newrel_m65,newrel_f014,newrel_f1524,newrel_f2534,newrel_f3544,newrel_f4554,newrel_f5564,newrel_f65
0,Afghanistan,1980,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,1981,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,1982,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Afghanistan,1983,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Afghanistan,1984,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7235,Zimbabwe,2009,125.0,578.0,NaN,3471.0,681.0,293.0,192.0,180.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7236,Zimbabwe,2010,150.0,710.0,2208.0,1682.0,761.0,350.0,252.0,173.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7237,Zimbabwe,2011,152.0,784.0,2467.0,2071.0,780.0,377.0,278.0,174.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7238,Zimbabwe,2012,120.0,783.0,2421.0,2086.0,796.0,360.0,271.0,173.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7239,Zimbabwe,2013,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,2349.0,1206.0,1208.0,1252.0,2069.0,4649.0,3526.0,1453.0,811.0,725.0

Next - let's `melt` the data to change it from "wide" form to "long" form. First we have to `melt` the data <https://pandas.pydata.org/docs/reference/api/pandas.melt.html> which changes the data to make it long form. We'll tell melt which of the columns are the observations, and it will assume (without us specifying) that the rest of the columns are variables.

In [4]:
tb=tb.melt(id_vars=['country', 'year'])

In [5]:
tb

            country  year     variable  value
0       Afghanistan  1980  new_sp_m014    NaN
1       Afghanistan  1981  new_sp_m014    NaN
2       Afghanistan  1982  new_sp_m014    NaN
3       Afghanistan  1983  new_sp_m014    NaN
4       Afghanistan  1984  new_sp_m014    NaN
...             ...   ...          ...    ...
405435     Zimbabwe  2009   newrel_f65    NaN
405436     Zimbabwe  2010   newrel_f65    NaN
405437     Zimbabwe  2011   newrel_f65    NaN
405438     Zimbabwe  2012   newrel_f65    NaN
405439     Zimbabwe  2013   newrel_f65  725.0

[405440 rows x 4 columns]

Now even just an examination of this table above tells us that the data wasn't entered in really well. You can see that though the top "variables" are "new_sp_m014" the bottom are "newrel_f65" - the underscore separates new/old from type of TB in the top part, but not in the bottom ones.  So let's first replace all the "newrel" with "new_rel".

To do this, we have to first pull out just the column we are interested in (in this case `variable`) like so:

In [6]:
tb['variable']

0         new_sp_m014
1         new_sp_m014
2         new_sp_m014
3         new_sp_m014
4         new_sp_m014
             ...
405435     newrel_f65
405436     newrel_f65
405437     newrel_f65
405438     newrel_f65
405439     newrel_f65
Name: variable, Length: 405440, dtype: object

Then we need to do a "find/replace" to change all the places we see "newrel" to "new_rel".  We can do this with ".str.replace" from pandas <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.replace.html>

In [7]:
tb['variable']=tb['variable'].str.replace('newrel', 'new_rel')
tb

            country  year     variable  value
0       Afghanistan  1980  new_sp_m014    NaN
1       Afghanistan  1981  new_sp_m014    NaN
2       Afghanistan  1982  new_sp_m014    NaN
3       Afghanistan  1983  new_sp_m014    NaN
4       Afghanistan  1984  new_sp_m014    NaN
...             ...   ...          ...    ...
405435     Zimbabwe  2009  new_rel_f65    NaN
405436     Zimbabwe  2010  new_rel_f65    NaN
405437     Zimbabwe  2011  new_rel_f65    NaN
405438     Zimbabwe  2012  new_rel_f65    NaN
405439     Zimbabwe  2013  new_rel_f65  725.0

[405440 rows x 4 columns]

Next we have to split up that variable column into the four different parts - new/old cases, type of TB, sex, and age range.  We can first split the text by the underscores to break it into three pieces using "string split" <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.split.html>.  We just tell the function what we want to split by, in this case "_"

In [8]:
tb['variable'].str.split('_', expand=True)

          0    1     2
0       new   sp  m014
1       new   sp  m014
2       new   sp  m014
3       new   sp  m014
4       new   sp  m014
...     ...  ...   ...
405435  new  rel   f65
405436  new  rel   f65
405437  new  rel   f65
405438  new  rel   f65
405439  new  rel   f65

[405440 rows x 3 columns]

New Old is whether the ccase is new or old

In [9]:
tb[['new_old', 'type', 'sex_age']]=tb['variable'].str.split('_', expand=True)
tb

            country  year     variable  value new_old type sex_age
0       Afghanistan  1980  new_sp_m014    NaN     new   sp    m014
1       Afghanistan  1981  new_sp_m014    NaN     new   sp    m014
2       Afghanistan  1982  new_sp_m014    NaN     new   sp    m014
3       Afghanistan  1983  new_sp_m014    NaN     new   sp    m014
4       Afghanistan  1984  new_sp_m014    NaN     new   sp    m014
...             ...   ...          ...    ...     ...  ...     ...
405435     Zimbabwe  2009  new_rel_f65    NaN     new  rel     f65
405436     Zimbabwe  2010  new_rel_f65    NaN     new  rel     f65
405437     Zimbabwe  2011  new_rel_f65    NaN     new  rel     f65
405438     Zimbabwe  2012  new_rel_f65    NaN     new  rel     f65
405439     Zimbabwe  2013  new_rel_f65  725.0     new  rel     f65

[405440 rows x 7 columns]

Ok - so next we have to try to split up the "sex_age" column to the different values.  Since the sex is always a single character in this case "m" or "f" - so if we just slice off the first character, we should be able to get what we need. The pandas `str.slice` function can help us with this <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.slice.html>

In [10]:
tb['sex_age'].str.slice(start=-2)

0         14
1         14
2         14
3         14
4         14
          ..
405435    65
405436    65
405437    65
405438    65
405439    65
Name: sex_age, Length: 405440, dtype: object

In [11]:
tb['sex']=tb['sex_age'].str.slice(0,1)
tb['age']=tb['sex_age'].str.slice(1)
tb

            country  year     variable  value new_old type sex_age sex  age
0       Afghanistan  1980  new_sp_m014    NaN     new   sp    m014   m  014
1       Afghanistan  1981  new_sp_m014    NaN     new   sp    m014   m  014
2       Afghanistan  1982  new_sp_m014    NaN     new   sp    m014   m  014
3       Afghanistan  1983  new_sp_m014    NaN     new   sp    m014   m  014
4       Afghanistan  1984  new_sp_m014    NaN     new   sp    m014   m  014
...             ...   ...          ...    ...     ...  ...     ...  ..  ...
405435     Zimbabwe  2009  new_rel_f65    NaN     new  rel     f65   f   65
405436     Zimbabwe  2010  new_rel_f65    NaN     new  rel     f65   f   65
405437     Zimbabwe  2011  new_rel_f65    NaN     new  rel     f65   f   65
405438     Zimbabwe  2012  new_rel_f65    NaN     new  rel     f65   f   65
405439     Zimbabwe  2013  new_rel_f65  725.0     new  rel     f65   f   65

[405440 rows x 9 columns]

Ok - we are getting close.  We can drop the "unsplit" columns and we should probably process the age range to make it a bit more intuitive to read:

In [16]:
tb['age'].unique()

array(['014', '1524', '2534', '3544', '4554', '5564', '65'], dtype=object)

In [12]:
tb=tb.drop(columns=['variable', 'sex_age'])
tb['age']=tb['age'].str.replace('014', '0-14')
tb['age']=tb['age'].str.replace('1524', '15-24')
tb['age']=tb['age'].str.replace('2534', '25-34')
tb['age']=tb['age'].str.replace('3544', '35-44')
tb['age']=tb['age'].str.replace('4554', '45-54')
tb['age']=tb['age'].str.replace('5564', '55-64')
tb['age']=tb['age'].str.replace('65', '65+')
tb

            country  year  value new_old type sex   age
0       Afghanistan  1980    NaN     new   sp   m  0-14
1       Afghanistan  1981    NaN     new   sp   m  0-14
2       Afghanistan  1982    NaN     new   sp   m  0-14
3       Afghanistan  1983    NaN     new   sp   m  0-14
4       Afghanistan  1984    NaN     new   sp   m  0-14
...             ...   ...    ...     ...  ...  ..   ...
405435     Zimbabwe  2009    NaN     new  rel   f   65+
405436     Zimbabwe  2010    NaN     new  rel   f   65+
405437     Zimbabwe  2011    NaN     new  rel   f   65+
405438     Zimbabwe  2012    NaN     new  rel   f   65+
405439     Zimbabwe  2013  725.0     new  rel   f   65+

[405440 rows x 7 columns]

Let's also say that we want to write out our "fixed" and tidy dataframe to a spreadsheet to open in excel or other.  We can do that with `to_csv` <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html>

In [13]:
tb.to_csv('cleaned_who.csv')

Ok - _finally_ we've got the data clean.  As is frequently the case, "cleaning" the data takes a large portion of the time, especially if the data comes from someone else: 

<img src="files/datasci_tweet.PNG" width=400>

Now let's look at the data and subset it to calculate certain statistics on it!

Let's set ourselves a problem - let's say we want to find all the countries which had a higher than median number of cases in 2000.

First, we'll make a new subset of the data where the year matches 2000 like so:

In [15]:
x=tb['year']==2000
x

0         False
1         False
2         False
3         False
4         False
          ...
405435    False
405436    False
405437    False
405438    False
405439    False
Name: year, Length: 405440, dtype: bool

In [16]:
tb[x]

                          country  year  value new_old type sex   age
20                    Afghanistan  2000   52.0     new   sp   m  0-14
54                        Albania  2000    2.0     new   sp   m  0-14
88                        Algeria  2000   59.0     new   sp   m  0-14
122                American Samoa  2000    NaN     new   sp   m  0-14
156                       Andorra  2000    0.0     new   sp   m  0-14
...                           ...   ...    ...     ...  ...  ..   ...
405290  Wallis and Futuna Islands  2000    NaN     new  rel   f   65+
405324   West Bank and Gaza Strip  2000    NaN     new  rel   f   65+
405358                      Yemen  2000    NaN     new  rel   f   65+
405392                     Zambia  2000    NaN     new  rel   f   65+
405426                   Zimbabwe  2000    NaN     new  rel   f   65+

[11872 rows x 7 columns]

In [17]:
twothousand=tb[tb['year']==2000]
twothousand

                          country  year  value new_old type sex   age
20                    Afghanistan  2000   52.0     new   sp   m  0-14
54                        Albania  2000    2.0     new   sp   m  0-14
88                        Algeria  2000   59.0     new   sp   m  0-14
122                American Samoa  2000    NaN     new   sp   m  0-14
156                       Andorra  2000    0.0     new   sp   m  0-14
...                           ...   ...    ...     ...  ...  ..   ...
405290  Wallis and Futuna Islands  2000    NaN     new  rel   f   65+
405324   West Bank and Gaza Strip  2000    NaN     new  rel   f   65+
405358                      Yemen  2000    NaN     new  rel   f   65+
405392                     Zambia  2000    NaN     new  rel   f   65+
405426                   Zimbabwe  2000    NaN     new  rel   f   65+

[11872 rows x 7 columns]

Can't help but notice there are a lot of rows where the value is "NaN" - this means "Not a Number" - or - there is no data for this observation.  Let's go ahead and cull out those rows:

In [18]:
twothousand=twothousand.dropna()
twothousand

            country  year  value new_old type sex    age
20      Afghanistan  2000   52.0     new   sp   m   0-14
54          Albania  2000    2.0     new   sp   m   0-14
88          Algeria  2000   59.0     new   sp   m   0-14
156         Andorra  2000    0.0     new   sp   m   0-14
190          Angola  2000  186.0     new   sp   m   0-14
...             ...   ...    ...     ...  ...  ..    ...
288554  Switzerland  2000    3.0     new   ep   f  45-54
292790       Israel  2000    6.0     new   ep   f  55-64
295794  Switzerland  2000    4.0     new   ep   f  55-64
300030       Israel  2000   26.0     new   ep   f    65+
303034  Switzerland  2000   12.0     new   ep   f    65+

[2329 rows x 7 columns]

Let's filter this further, and only keep the cases with people >35:

In [19]:
oldtwothousand=twothousand[twothousand['age'].isin(['35-44', '45-54','55-64','65+'])]
oldtwothousand

            country  year  value new_old type sex    age
21740   Afghanistan  2000  149.0     new   sp   m  35-44
21774       Albania  2000   14.0     new   sp   m  35-44
21808       Algeria  2000  610.0     new   sp   m  35-44
21876       Andorra  2000    0.0     new   sp   m  35-44
21910        Angola  2000  912.0     new   sp   m  35-44
...             ...   ...    ...     ...  ...  ..    ...
288554  Switzerland  2000    3.0     new   ep   f  45-54
292790       Israel  2000    6.0     new   ep   f  55-64
295794  Switzerland  2000    4.0     new   ep   f  55-64
300030       Israel  2000   26.0     new   ep   f    65+
303034  Switzerland  2000   12.0     new   ep   f    65+

[1334 rows x 7 columns]

Now let's add up the number of cases **per country**.  To do this, we need to basically group the dataframe on the `country`, then apply sum all the cases for that country in the split frame, then  recombine the resulting data.  It follows this sort of idea (from <https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html>) 

<img src="files/03.08-split-apply-combine.png" width=400>

We can implement it with `groupby` <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html>, followed by `sum`.  With `groupby` I'm going to extract only the column I want (`value`) which will make it a "Series" instead of a full dataframe, with the countries now being the rownames or Indexes.

In [21]:
grouped=oldtwothousand.groupby(by=['country']) ['value']
percountry_old2000=grouped.sum()
percountry_old2000

country
Afghanistan        1131.0
Albania             105.0
Algeria            3214.0
American Samoa        3.0
Andorra               0.0
                   ...
Uzbekistan         1900.0
Vanuatu              32.0
Viet Nam          40886.0
Yemen              2390.0
Zambia             5593.0
Name: value, Length: 168, dtype: float64

In [ ]:
oldtwothousand[oldtwothousand['country']=='Algeria']

       country  year  value new_old type sex    age
21808  Algeria  2000  610.0     new   sp   m  35-44
29048  Algeria  2000  491.0     new   sp   m  45-54
36288  Algeria  2000  234.0     new   sp   m  55-64
43528  Algeria  2000  299.0     new   sp   m    65+
72488  Algeria  2000  746.0     new   sp   f  35-44
79728  Algeria  2000  314.0     new   sp   f  45-54
86968  Algeria  2000  208.0     new   sp   f  55-64
94208  Algeria  2000  312.0     new   sp   f    65+

And the median of these values is:

In [22]:
percountry_old2000.median()

np.float64(407.0)

Now let's find the countries that had more than that - again using the square brackets and a conditional to select subsets of the data:

In [27]:
morecases=percountry_old2000[percountry_old2000>percountry_old2000.median()]
morecases.index

Index(['Afghanistan', 'Algeria', 'Angola', 'Argentina', 'Bangladesh', 'Benin',
       'Bolivia (Plurinational State of)', 'Bosnia and Herzegovina',
       'Botswana', 'Brazil', 'Burkina Faso', 'Cambodia', 'Cameroon', 'Chile',
       'China', 'China, Hong Kong SAR', 'Colombia',
       'Democratic People's Republic of Korea',
       'Democratic Republic of the Congo', 'Djibouti', 'Dominican Republic',
       'Egypt', 'El Salvador', 'Ethiopia', 'France', 'Ghana', 'Guatemala',
       'Guinea', 'Haiti', 'Honduras', 'India', 'Iran (Islamic Republic of)',
       'Iraq', 'Japan', 'Kazakhstan', 'Kenya', 'Kyrgyzstan',
       'Lao People's Democratic Republic', 'Latvia', 'Lesotho', 'Lithuania',
       'Malawi', 'Malaysia', 'Mali', 'Mexico', 'Mongolia', 'Morocco',
       'Myanmar', 'Namibia', 'Nepal', 'Nicaragua', 'Niger', 'Nigeria',
       'Pakistan', 'Paraguay', 'Peru', 'Poland', 'Portugal',
       'Republic of Korea', 'Romania', 'Russian Federation', 'Rwanda',
       'Saudi Arabia', 'Senegal', 'Sierra Leone', 'Somalia', 'South Africa',
       'Sri Lanka', 'Sudan', 'Swaziland', 'Syrian Arab Republic', 'Thailand',
       'Togo', 'Tunisia', 'Turkmenistan', 'Uganda', 'Ukraine',
       'United Kingdom of Great Britain and Northern Ireland',
       'United Republic of Tanzania', 'United States of America', 'Uzbekistan',
       'Viet Nam', 'Yemen', 'Zambia'],
      dtype='object', name='country')

### Exercise:
Please calculate the average case number for Brazil, Chile, and Peru for each age bracket that you have data for.

In [26]:
brazil=tb[tb['country']=='Brazil']
brazil=brazil.dropna()
brazil

       country  year   value new_old type sex    age
941     Brazil  1999   301.0     new   sp   m   0-14
942     Brazil  2000  1894.0     new   sp   m   0-14
943     Brazil  2001   468.0     new   sp   m   0-14
944     Brazil  2002   344.0     new   sp   m   0-14
945     Brazil  2003   382.0     new   sp   m   0-14
...        ...   ...     ...     ...  ...  ..    ...
370195  Brazil  2013  5673.0     new  rel   f  25-34
377435  Brazil  2013  4547.0     new  rel   f  35-44
384675  Brazil  2013  3868.0     new  rel   f  45-54
391915  Brazil  2013  2672.0     new  rel   f  55-64
399155  Brazil  2013  2580.0     new  rel   f    65+

[406 rows x 7 columns]

In [33]:
brazilgroup=brazil.groupby(by=['country','age','sex'])['value']
brazilgroup.mean()

country  age    sex
Brazil   0-14   f       501.275862
                m       521.068966
         15-24  f      2258.620690
                m      3277.724138
         25-34  f      2602.172414
                m      4612.896552
         35-44  f      1963.896552
                m      4315.034483
         45-54  f      1475.931034
                m      3677.758621
         55-64  f       935.620690
                m      2179.689655
         65+    f       931.965517
                m      1734.448276
Name: value, dtype: float64

In [31]:
countrystuff=tb[tb['country'].isin(['Brazil', 'Chile', 'Peru'])]
countrystuff.groupby(by=['country', 'age'])['value'].mean()

country  age
Brazil   0-14      511.172414
         15-24    2768.172414
         25-34    3607.534483
         35-44    3139.465517
         45-54    2576.844828
         55-64    1557.655172
         65+      1333.206897
Chile    0-14        9.187500
         15-24      58.921875
         25-34      88.765625
         35-44      90.593750
         45-54      87.843750
         55-64      71.906250
         65+        93.453125
Peru     0-14      347.088235
         15-24    2905.970588
         25-34    1808.794118
         35-44    1017.205882
         45-54     666.882353
         55-64     464.441176
         65+       522.000000
Name: value, dtype: float64

In [40]:
twothousand

            country  year  value new_old type sex    age
20      Afghanistan  2000   52.0     new   sp   m   0-14
54          Albania  2000    2.0     new   sp   m   0-14
88          Algeria  2000   59.0     new   sp   m   0-14
156         Andorra  2000    0.0     new   sp   m   0-14
190          Angola  2000  186.0     new   sp   m   0-14
...             ...   ...    ...     ...  ...  ..    ...
288554  Switzerland  2000    3.0     new   ep   f  45-54
292790       Israel  2000    6.0     new   ep   f  55-64
295794  Switzerland  2000    4.0     new   ep   f  55-64
300030       Israel  2000   26.0     new   ep   f    65+
303034  Switzerland  2000   12.0     new   ep   f    65+

[2329 rows x 7 columns]

In [43]:
tb[tb['country'].isin(['Brazil', 'Chile','Peru'])].groupby(by=['country', 'age'])['value'].mean()

country  age
Brazil   0-14      511.172414
         15-24    2768.172414
         25-34    3607.534483
         35-44    3139.465517
         45-54    2576.844828
         55-64    1557.655172
         65+      1333.206897
Chile    0-14        9.187500
         15-24      58.921875
         25-34      88.765625
         35-44      90.593750
         45-54      87.843750
         55-64      71.906250
         65+        93.453125
Peru     0-14      347.088235
         15-24    2905.970588
         25-34    1808.794118
         35-44    1017.205882
         45-54     666.882353
         55-64     464.441176
         65+       522.000000
Name: value, dtype: float64